# Week 5 Day 1 - Pandas

[Pandas](https://pandas.pydata.org) is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. It is free software released under the three-clause BSD license.

In [1]:
import pandas as pd

In [2]:
# make a dictionary with lists as values
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

In [4]:
#make it a dataframe
mycars = pd.DataFrame(mydataset)
mycars

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [5]:
#get the information of your dataframe

mycars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   cars      3 non-null      object
 1   passings  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [6]:
#get the shape of your dataframe
mycars.shape

(3, 2)

In [7]:
#get the columns
mycars.columns

Index(['cars', 'passings'], dtype='object')

In [8]:
#get the rows
mycars.values

array([['BMW', 3],
       ['Volvo', 7],
       ['Ford', 2]], dtype=object)

In [ ]:
# getting the index
mycars.index.values

array([0, 1, 2])

In [11]:
#get the axis
mycars.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['cars', 'passings'], dtype='object')]

In [15]:
mycars

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [14]:
#get the first row
mycars.loc[0]

cars        BMW
passings      3
Name: 0, dtype: object

In [16]:
mycars.loc[2]

cars        Ford
passings       2
Name: 2, dtype: object

In [17]:
type(mycars.loc[2])

pandas.core.series.Series

In [20]:
#use a list of indexs:

mycars.loc[[0,2]]

   cars  passings
0   BMW         3
2  Ford         2

In [21]:
#get a column
mycars['cars']

0      BMW
1    Volvo
2     Ford
Name: cars, dtype: object

In [22]:
#get the rows
mycars.loc[[0, 1, 2]]

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [23]:
#what are the datatypes of the dataframe
mycars.dtypes

cars        object
passings     int64
dtype: object

In [26]:
#change column 'passings' to float

mycars['passings'].astype('float')

0    3.0
1    7.0
2    2.0
Name: passings, dtype: float64

In [27]:
#look at it again
mycars.dtypes

cars        object
passings     int64
dtype: object

In [28]:
mycars['passings'] = mycars['passings'].astype('float')

In [29]:
mycars.dtypes

cars         object
passings    float64
dtype: object

In [30]:
#get rid of the last row

mycars.drop(2)

    cars  passings
0    BMW       3.0
1  Volvo       7.0

In [35]:
mycars
newDf = mycars.drop(2)
newDf

    cars  passings
0    BMW       3.0
1  Volvo       7.0

In [37]:
#get rid of the passings column
newDf2 = newDf.drop('passings', axis = 'columns')
newDf2

    cars
0    BMW
1  Volvo

<!--  -->

### NaN & empty data

In [39]:
import numpy as np

uglyData = {
  'cars': ["BMW", 'Jeep', "Ford", 'Chrysler'],
  'passings': [3, np.nan, 2, 'NaN']
}

uglyDF = pd.DataFrame(uglyData)

In [41]:
uglyDF

       cars passings
0       BMW        3
1      Jeep      NaN
2      Ford        2
3  Chrysler      NaN

In [42]:
#drop the Nan

uglyDF_clean = uglyDF.dropna()

In [49]:
#replace it with 0
uglyDF_clean2 = uglyDF.fillna(0)
uglyDF_clean2

       cars passings
0       BMW        3
1      Jeep        0
2      Ford        2
3  Chrysler      NaN

<!--  -->

### .csv Files

**pd.read_csv** 

A simple way to store big data sets is to use CSV files (comma separated files).
CSV files contains plain text and is a well know format that can be read by everyone including Pandas.

*pd.read_csv(filepath_or_buffer, sep=’ ,’ , header=’infer’,  index_col=None, usecols=None, engine=None, skiprows=None, nrows=None)*

In [50]:
#import tv_shows.csv

df = pd.read_csv('class_data/tv_shows.csv')

In [51]:
df

,Unnamed: 0,title,year,runtime,rating,votes,genre,text
0,0,Game of Thrones,(2011 TV Series),55 mins.,9.5,"748,557","[u'Adventure', u'Drama', u'Fantasy']",Several noble families fight for control of th...
1,1,Breaking Bad,(2008 TV Series),45 mins.,9.5,"662,459","[u'Crime', u'Drama', u'Thriller']",A chemistry teacher diagnosed with a terminal ...
2,2,The Walking Dead,(2010 TV Series),44 mins.,8.7,"500,301","[u'Drama', u'Horror']",Sheriff's Deputy Rick Grimes leads a group of ...
3,3,The Big Bang Theory,(2007 TV Series),22 mins.,8.5,"438,226",[u'Comedy'],A woman who moves into an apartment across the...
4,4,Dexter,(2006 TV Series),55 mins.,8.9,"419,031","[u'Crime', u'Drama', u'Mystery', u'Thriller']",A Miami police forensics expert moonlights as ...
...,...,...,...,...,...,...,...,...
1969,1969,Cristela,(2014 TV Series),30 mins.,6.3,"1,510",[u'Comedy'],"In her sixth year of law school, Cristela is f..."
1970,1970,Power Rangers in Space,(1998 TV Series),30 mins.,7.2,"1,504","[u'Action', u'Adventure', u'Family', u'Sci-Fi']",The most evil forces of the universe (Rita &am...
1971,1971,Reading Rainbow,(1983 TV Series),30 mins.,8.5,"1,501",[u'Family'],Levar Burton introduces young viewers to illus...
1972,1972,Martial Law,(1998 TV Series),45 mins.,7.1,"1,501","[u'Comedy', u'Crime', u'Action']",A Shanghai cop who is a master of martial arts...
1973,1973,Beast Machines: Transformers,(1999 TV Series),30 mins.,6.9,"1,500","[u'Action', u'Animation', u'Sci-Fi']",The Maximals awaken on their home planet of Cy...

In [52]:
#get a preview
df.head()

,Unnamed: 0,title,year,runtime,rating,votes,genre,text
0,0,Game of Thrones,(2011 TV Series),55 mins.,9.5,"748,557","[u'Adventure', u'Drama', u'Fantasy']",Several noble families fight for control of th...
1,1,Breaking Bad,(2008 TV Series),45 mins.,9.5,"662,459","[u'Crime', u'Drama', u'Thriller']",A chemistry teacher diagnosed with a terminal ...
2,2,The Walking Dead,(2010 TV Series),44 mins.,8.7,"500,301","[u'Drama', u'Horror']",Sheriff's Deputy Rick Grimes leads a group of ...
3,3,The Big Bang Theory,(2007 TV Series),22 mins.,8.5,"438,226",[u'Comedy'],A woman who moves into an apartment across the...
4,4,Dexter,(2006 TV Series),55 mins.,8.9,"419,031","[u'Crime', u'Drama', u'Mystery', u'Thriller']",A Miami police forensics expert moonlights as ...

In [53]:
#what columns of the csv file
df.columns

Index(['Unnamed: 0', 'title', 'year', 'runtime', 'rating', 'votes', 'genre',
       'text'],
      dtype='object')

In [59]:
# Return the number of not empty cells for each column/row
df.count()

Unnamed: 0    1974
title         1974
year          1974
runtime       1814
rating        1974
votes         1974
genre         1970
text          1941
dtype: int64

In [61]:
df2 = df.dropna()
df2.count()

Unnamed: 0    1792
title         1792
year          1792
runtime       1792
rating        1792
votes         1792
genre         1792
text          1792
dtype: int64

In [63]:
#only import the columns ["title", "year", "rating", "votes"]

df3 = pd.read_csv('class_data/tv_shows.csv', usecols = ['title', 'year', 'rating', 'votes'])
df3.head()

                 title              year  rating    votes
0      Game of Thrones  (2011 TV Series)     9.5  748,557
1         Breaking Bad  (2008 TV Series)     9.5  662,459
2     The Walking Dead  (2010 TV Series)     8.7  500,301
3  The Big Bang Theory  (2007 TV Series)     8.5  438,226
4               Dexter  (2006 TV Series)     8.9  419,031

In [64]:
df3.count()

title     1974
year      1974
rating    1974
votes     1974
dtype: int64

In [66]:
#what is the maximum rating? 
df3['rating'].max()

9.6

In [67]:
#what is the minimum rating?
df3['rating'].min()

1.8

In [69]:
#find the avg of all of the ratings

avgNum = df3['rating'].mean()
avgNum

7.486524822695036

In [70]:
df3.head()

                 title              year  rating    votes
0      Game of Thrones  (2011 TV Series)     9.5  748,557
1         Breaking Bad  (2008 TV Series)     9.5  662,459
2     The Walking Dead  (2010 TV Series)     8.7  500,301
3  The Big Bang Theory  (2007 TV Series)     8.5  438,226
4               Dexter  (2006 TV Series)     8.9  419,031

In [71]:
#what data types of the dataframe? 


df3.dtypes

title      object
year       object
rating    float64
votes      object
dtype: object

In [ ]:
#can you change the datatype of votes?
df3['votes'] = df3['v'].astype('float64')

In [74]:
#set the index to be the names of the tv show
df3

df4 = df3.set_index('title')
df4.head()

                                 year  rating    votes
title
Game of Thrones      (2011 TV Series)     9.5  748,557
Breaking Bad         (2008 TV Series)     9.5  662,459
The Walking Dead     (2010 TV Series)     8.7  500,301
The Big Bang Theory  (2007 TV Series)     8.5  438,226
Dexter               (2006 TV Series)     8.9  419,031

In [ ]:
#get the year of hte new dataframe

df4['year']

title
Game of Thrones                 (2011 TV Series)
Breaking Bad                    (2008 TV Series)
The Walking Dead                (2010 TV Series)
The Big Bang Theory             (2007 TV Series)
Dexter                          (2006 TV Series)
                                      ...
Cristela                        (2014 TV Series)
Power Rangers in Space          (1998 TV Series)
Reading Rainbow                 (1983 TV Series)
Martial Law                     (1998 TV Series)
Beast Machines: Transformers    (1999 TV Series)
Name: year, Length: 1974, dtype: object

<!--  -->

### .json files

**pd.read_json**

JSON = Python Dictionary

JSON objects have the same format as Python dictionaries. If your JSON code is not in a file, but in a Python Dictionary, you can load it into a DataFrame directly.

In [77]:
dataJson = {
    'item1':{
        "0":60,
        "1":60,
        "2":60
    },
    'item2':{
        '0':100,
        '1':100,
        '2':100
    }
}

In [78]:
dfjson = pd.DataFrame(dataJson)

In [79]:
#read in nationalParks.json
df = pd.read_json('class_data/nationalParks.json')
df.head()

,area,coordinates,date_established_readable,date_established_unix,description,image,nps_link,states,title,id,visitors,world_heritage_site
0,"{'acres': '49,057.36', 'square_km': '198.5'}","{'latitude': 44.35, 'longitude': -68.21}","February 26, 1919",-1604599200,Covering most of Mount Desert Island and other...,"{'url': 'acadia.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/acad/index.htm,"[{'id': 'state_maine', 'title': 'Maine'}]",Acadia,park_acadia,"3,303,393",False
1,"{'acres': '8,256.67', 'square_km': '33.4'}","{'latitude': -14.25, 'longitude': -170.68}","October 31, 1988",594280800,The southernmost National Park is on three Sam...,"{'url': 'american-samoa.jpg', 'attribution': '...",https://www.nps.gov/npsa/index.htm,"[{'id': 'state_american-samoa', 'title': 'Amer...",American Samoa,park_american-samoa,"28,892",False
2,"{'acres': '76,678.98', 'square_km': '310.3'}","{'latitude': 38.68, 'longitude': -109.57}","November 12, 1971",58773600,"This site features more than 2,000 natural san...","{'url': 'arches.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/arch/index.htm,"[{'id': 'state_utah', 'title': 'Utah'}]",Arches,park_arches,"1,585,718",False
3,"{'acres': '242,755.94', 'square_km': '982.4'}","{'latitude': 43.75, 'longitude': -102.5}","November 10, 1978",279525600,"The Badlands are a collection of buttes, pinna...","{'url': 'badlands.jpg', 'attribution': 'PixelB...",https://www.nps.gov/badl/index.htm,"[{'id': 'state_south-dakota', 'title': 'South ...",Badlands,park_badlands,"996,263",False
4,"{'acres': '801,163.21', 'square_km': '3,242.2'}","{'latitude': 29.25, 'longitude': -103.25}","June 12, 1944",-806439600,Named for the prominent bend in the Rio Grande...,"{'url': 'big-bend.jpg', 'attribution': 'PixelB...",https://www.nps.gov/bibe/index.htm,"[{'id': 'state_texas', 'title': 'Texas'}]",Big Bend,park_big-bend,"388,290",False

In [80]:
df.dtypes

area                         object
coordinates                  object
date_established_readable    object
date_established_unix         int64
description                  object
image                        object
nps_link                     object
states                       object
title                        object
id                           object
visitors                     object
world_heritage_site            bool
dtype: object

In [113]:
#only get the ['date_established_readable','description', 'title', 'visitors', 'world_heritage_site', 'states ]

df2 = df[['title', 'visitors','description','date_established_readable', 'world_heritage_site', 'states']]

In [114]:
#get the datatypes
df2.dtypes

title                        object
visitors                     object
description                  object
date_established_readable    object
world_heritage_site            bool
states                       object
dtype: object

In [115]:
#find the national parks that are world heritage sites

whsNum = df2[df['world_heritage_site'] == True]
len(whsNum)

14

<!--  -->

#### Exercise 1: get the national parks with over a million visitors

In [116]:
df2_cleanVis = df2['visitors'].replace(',', '', regex = True)

df2_cleanVis.head()

0    3303393
1      28892
2    1585718
3     996263
4     388290
Name: visitors, dtype: object

<!--  -->

In [130]:
# Ensure visitors column is numeric if not already
df['visitors'] = df['visitors'].str.replace(',', '').astype(float)

# Filter for parks with over a million visitors
million_visitors_df = df[df['visitors'] > 1_000_000]

# View the result
print(million_visitors_df[['title', 'visitors']])

                    title    visitors
0                  Acadia   3303393.0
2                  Arches   1585718.0
7            Bryce Canyon   2365110.0
9            Capitol Reef   1064904.0
14        Cuyahoga Valley   2423390.0
15           Death Valley   1296283.0
20                Glacier   2946681.0
22           Grand Canyon   5969811.0
23            Grand Teton   3270076.0
26  Great Smoky Mountains  11312786.0
28              Haleakala   1263558.0
29       Hawaii Volcanoes   1887580.0
30            Hot Springs   1544300.0
32            Joshua Tree   2505286.0
41          Mount Rainier   1356913.0
43                Olympic   3390221.0
47         Rocky Mountain   4517585.0
49                Sequoia   1254688.0
50             Shenandoah   1437341.0
56            Yellowstone   4257177.0
57               Yosemite   5028868.0
58                   Zion   4295127.0

### Exercise 2: Create a dictionary of the number of national parks per state

In [121]:
df2['states'][0]

[{'id': 'state_maine', 'title': 'Maine'}]

In [122]:
type(df2['states'][0])

list

In [123]:
df2['states'][0][0]

{'id': 'state_maine', 'title': 'Maine'}

In [124]:
type(df2['states'][0][0])

dict

In [125]:
df2['states'][0][0]['title']

'Maine'

In [127]:
df2_big = df.explode('states')
df2_big.head()

,area,coordinates,date_established_readable,date_established_unix,description,image,nps_link,states,title,id,visitors,world_heritage_site
0,"{'acres': '49,057.36', 'square_km': '198.5'}","{'latitude': 44.35, 'longitude': -68.21}","February 26, 1919",-1604599200,Covering most of Mount Desert Island and other...,"{'url': 'acadia.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/acad/index.htm,"{'id': 'state_maine', 'title': 'Maine'}",Acadia,park_acadia,"3,303,393",False
1,"{'acres': '8,256.67', 'square_km': '33.4'}","{'latitude': -14.25, 'longitude': -170.68}","October 31, 1988",594280800,The southernmost National Park is on three Sam...,"{'url': 'american-samoa.jpg', 'attribution': '...",https://www.nps.gov/npsa/index.htm,"{'id': 'state_american-samoa', 'title': 'Ameri...",American Samoa,park_american-samoa,"28,892",False
2,"{'acres': '76,678.98', 'square_km': '310.3'}","{'latitude': 38.68, 'longitude': -109.57}","November 12, 1971",58773600,"This site features more than 2,000 natural san...","{'url': 'arches.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/arch/index.htm,"{'id': 'state_utah', 'title': 'Utah'}",Arches,park_arches,"1,585,718",False
3,"{'acres': '242,755.94', 'square_km': '982.4'}","{'latitude': 43.75, 'longitude': -102.5}","November 10, 1978",279525600,"The Badlands are a collection of buttes, pinna...","{'url': 'badlands.jpg', 'attribution': 'PixelB...",https://www.nps.gov/badl/index.htm,"{'id': 'state_south-dakota', 'title': 'South D...",Badlands,park_badlands,"996,263",False
4,"{'acres': '801,163.21', 'square_km': '3,242.2'}","{'latitude': 29.25, 'longitude': -103.25}","June 12, 1944",-806439600,Named for the prominent bend in the Rio Grande...,"{'url': 'big-bend.jpg', 'attribution': 'PixelB...",https://www.nps.gov/bibe/index.htm,"{'id': 'state_texas', 'title': 'Texas'}",Big Bend,park_big-bend,"388,290",False

In [128]:
df2_big['states'][0]['title']

'Maine'

In [131]:
df2_big['states_id'] = df2_big['states']
df2_big.head()

,area,coordinates,date_established_readable,date_established_unix,description,image,nps_link,states,title,id,visitors,world_heritage_site,states_id
0,"{'acres': '49,057.36', 'square_km': '198.5'}","{'latitude': 44.35, 'longitude': -68.21}","February 26, 1919",-1604599200,Covering most of Mount Desert Island and other...,"{'url': 'acadia.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/acad/index.htm,"{'id': 'state_maine', 'title': 'Maine'}",Acadia,park_acadia,"3,303,393",False,"{'id': 'state_maine', 'title': 'Maine'}"
1,"{'acres': '8,256.67', 'square_km': '33.4'}","{'latitude': -14.25, 'longitude': -170.68}","October 31, 1988",594280800,The southernmost National Park is on three Sam...,"{'url': 'american-samoa.jpg', 'attribution': '...",https://www.nps.gov/npsa/index.htm,"{'id': 'state_american-samoa', 'title': 'Ameri...",American Samoa,park_american-samoa,"28,892",False,"{'id': 'state_american-samoa', 'title': 'Ameri..."
2,"{'acres': '76,678.98', 'square_km': '310.3'}","{'latitude': 38.68, 'longitude': -109.57}","November 12, 1971",58773600,"This site features more than 2,000 natural san...","{'url': 'arches.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/arch/index.htm,"{'id': 'state_utah', 'title': 'Utah'}",Arches,park_arches,"1,585,718",False,"{'id': 'state_utah', 'title': 'Utah'}"
3,"{'acres': '242,755.94', 'square_km': '982.4'}","{'latitude': 43.75, 'longitude': -102.5}","November 10, 1978",279525600,"The Badlands are a collection of buttes, pinna...","{'url': 'badlands.jpg', 'attribution': 'PixelB...",https://www.nps.gov/badl/index.htm,"{'id': 'state_south-dakota', 'title': 'South D...",Badlands,park_badlands,"996,263",False,"{'id': 'state_south-dakota', 'title': 'South D..."
4,"{'acres': '801,163.21', 'square_km': '3,242.2'}","{'latitude': 29.25, 'longitude': -103.25}","June 12, 1944",-806439600,Named for the prominent bend in the Rio Grande...,"{'url': 'big-bend.jpg', 'attribution': 'PixelB...",https://www.nps.gov/bibe/index.htm,"{'id': 'state_texas', 'title': 'Texas'}",Big Bend,park_big-bend,"388,290",False,"{'id': 'state_texas', 'title': 'Texas'}"

In [134]:
stateParks = {}

# get the data in each of the states column

for i in df2_big['states']:
    
    # get just the names of the state
    print(i['title'])
    
    stateName = i['title']
    
    # add the number of each instance to a dictionary 
    if stateName in stateParks.keys():
        stateParks[stateName] += 1
        
    else:
        stateParks[stateName] = 1

Maine
American Samoa
Utah
South Dakota
Texas
Florida
Colorado
Utah
Utah
Utah
New Mexico
California
South Carolina
Oregon
Ohio
California
Nevada
Alaska
Florida
Florida
Alaska
Montana
Alaska
Arizona
Wyoming
Nevada
Colorado
Tennessee
North Carolina
Texas
Hawaii
Hawaii
Arkansas
Michigan
California
Alaska
Alaska
California
Alaska
Alaska
California
Kentucky
Colorado
Washington
Washington
Washington
Arizona
California
California
Colorado
Arizona
California
Virginia
North Dakota
US Virgin Islands
Minnesota
South Dakota
Alaska
Wyoming
Montana
Idaho
California
Utah

In [135]:
stateParks

{'Maine': 1,
 'American Samoa': 1,
 'Utah': 5,
 'South Dakota': 2,
 'Texas': 2,
 'Florida': 3,
 'Colorado': 4,
 'New Mexico': 1,
 'California': 9,
 'South Carolina': 1,
 'Oregon': 1,
 'Ohio': 1,
 'Nevada': 2,
 'Alaska': 8,
 'Montana': 2,
 'Arizona': 3,
 'Wyoming': 2,
 'Tennessee': 1,
 'North Carolina': 1,
 'Hawaii': 2,
 'Arkansas': 1,
 'Michigan': 1,
 'Kentucky': 1,
 'Washington': 3,
 'Virginia': 1,
 'North Dakota': 1,
 'US Virgin Islands': 1,
 'Minnesota': 1,
 'Idaho': 1}